HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_bf.h
/**
 * \file IfxSdmmc_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Sdmmc_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Sdmmc_Registers
 * 
 */
#ifndef IFXSDMMC_BF_H
#define IFXSDMMC_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Sdmmc_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_LEN (32u)

/** \brief Mask for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_OFF (0u)

/** \brief Length for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_LEN (12u)

/** \brief Mask for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_OFF (0u)

/** \brief Length for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_LEN (3u)

/** \brief Mask for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_OFF (12u)

/** \brief Length for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_LEN (16u)

/** \brief Mask for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_MSK (0xffffu)

/** \brief Offset for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_OFF (0u)

/** \brief Length for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_LEN (32u)

/** \brief Mask for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_OFF (0u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_OFF (0u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_OFF (1u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_LEN (2u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_OFF (2u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_OFF (4u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_OFF (5u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_OFF (6u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_OFF (7u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_INT_DISABLE */
#define IFX_SDMMC_XFER_MODE_RESP_INT_DISABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.RESP_INT_DISABLE */
#define IFX_SDMMC_XFER_MODE_RESP_INT_DISABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.RESP_INT_DISABLE */
#define IFX_SDMMC_XFER_MODE_RESP_INT_DISABLE_OFF (8u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.RESP_TYPE_SELECT */
#define IFX_SDMMC_CMD_RESP_TYPE_SELECT_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.RESP_TYPE_SELECT */
#define IFX_SDMMC_CMD_RESP_TYPE_SELECT_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.RESP_TYPE_SELECT */
#define IFX_SDMMC_CMD_RESP_TYPE_SELECT_OFF (0u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.SUB_CMD_FLAG */
#define IFX_SDMMC_CMD_SUB_CMD_FLAG_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.SUB_CMD_FLAG */
#define IFX_SDMMC_CMD_SUB_CMD_FLAG_MSK (0x1u)

