HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_CMD_Bits.SUB_CMD_FLAG */
#define IFX_SDMMC_CMD_SUB_CMD_FLAG_OFF (2u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.CMD_CRC_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_CRC_CHK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.CMD_CRC_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_CRC_CHK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.CMD_CRC_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_CRC_CHK_ENABLE_OFF (3u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.CMD_IDX_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_IDX_CHK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.CMD_IDX_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_IDX_CHK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.CMD_IDX_CHK_ENABLE */
#define IFX_SDMMC_CMD_CMD_IDX_CHK_ENABLE_OFF (4u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.DATA_PRESENT_SEL */
#define IFX_SDMMC_CMD_DATA_PRESENT_SEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.DATA_PRESENT_SEL */
#define IFX_SDMMC_CMD_DATA_PRESENT_SEL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.DATA_PRESENT_SEL */
#define IFX_SDMMC_CMD_DATA_PRESENT_SEL_OFF (5u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.CMD_TYPE */
#define IFX_SDMMC_CMD_CMD_TYPE_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.CMD_TYPE */
#define IFX_SDMMC_CMD_CMD_TYPE_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.CMD_TYPE */
#define IFX_SDMMC_CMD_CMD_TYPE_OFF (6u)

/** \brief Length for Ifx_SDMMC_CMD_Bits.CMD_INDEX */
#define IFX_SDMMC_CMD_CMD_INDEX_LEN (6u)

/** \brief Mask for Ifx_SDMMC_CMD_Bits.CMD_INDEX */
#define IFX_SDMMC_CMD_CMD_INDEX_MSK (0x3fu)

/** \brief Offset for Ifx_SDMMC_CMD_Bits.CMD_INDEX */
#define IFX_SDMMC_CMD_CMD_INDEX_OFF (8u)

/** \brief Length for Ifx_SDMMC_RESP01_Bits.RESP01 */
#define IFX_SDMMC_RESP01_RESP01_LEN (32u)

/** \brief Mask for Ifx_SDMMC_RESP01_Bits.RESP01 */
#define IFX_SDMMC_RESP01_RESP01_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_RESP01_Bits.RESP01 */
#define IFX_SDMMC_RESP01_RESP01_OFF (0u)

/** \brief Length for Ifx_SDMMC_RESP23_Bits.RESP23 */
#define IFX_SDMMC_RESP23_RESP23_LEN (32u)

/** \brief Mask for Ifx_SDMMC_RESP23_Bits.RESP23 */
#define IFX_SDMMC_RESP23_RESP23_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_RESP23_Bits.RESP23 */
#define IFX_SDMMC_RESP23_RESP23_OFF (0u)

/** \brief Length for Ifx_SDMMC_RESP45_Bits.RESP45 */
#define IFX_SDMMC_RESP45_RESP45_LEN (32u)

/** \brief Mask for Ifx_SDMMC_RESP45_Bits.RESP45 */
#define IFX_SDMMC_RESP45_RESP45_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_RESP45_Bits.RESP45 */
#define IFX_SDMMC_RESP45_RESP45_OFF (0u)

/** \brief Length for Ifx_SDMMC_RESP67_Bits.RESP67 */
#define IFX_SDMMC_RESP67_RESP67_LEN (32u)

/** \brief Mask for Ifx_SDMMC_RESP67_Bits.RESP67 */
#define IFX_SDMMC_RESP67_RESP67_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_RESP67_Bits.RESP67 */
#define IFX_SDMMC_RESP67_RESP67_OFF (0u)

/** \brief Length for Ifx_SDMMC_BUF_DATA_Bits.BUF_DATA */
#define IFX_SDMMC_BUF_DATA_BUF_DATA_LEN (32u)

/** \brief Mask for Ifx_SDMMC_BUF_DATA_Bits.BUF_DATA */
#define IFX_SDMMC_BUF_DATA_BUF_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_BUF_DATA_Bits.BUF_DATA */
#define IFX_SDMMC_BUF_DATA_BUF_DATA_OFF (0u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_OFF (0u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT_DAT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_DAT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT_DAT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_DAT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CMD_INHIBIT_DAT */
#define IFX_SDMMC_PSTATE_REG_CMD_INHIBIT_DAT_OFF (1u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.DAT_LINE_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_DAT_LINE_ACTIVE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.DAT_LINE_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_DAT_LINE_ACTIVE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.DAT_LINE_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_DAT_LINE_ACTIVE_OFF (2u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.RE_TUNE_REQ */
#define IFX_SDMMC_PSTATE_REG_RE_TUNE_REQ_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.RE_TUNE_REQ */
#define IFX_SDMMC_PSTATE_REG_RE_TUNE_REQ_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.RE_TUNE_REQ */
#define IFX_SDMMC_PSTATE_REG_RE_TUNE_REQ_OFF (3u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.DAT_7_4 */
#define IFX_SDMMC_PSTATE_REG_DAT_7_4_LEN (4u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.DAT_7_4 */
#define IFX_SDMMC_PSTATE_REG_DAT_7_4_MSK (0xfu)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.DAT_7_4 */
#define IFX_SDMMC_PSTATE_REG_DAT_7_4_OFF (4u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.WR_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_WR_XFER_ACTIVE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.WR_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_WR_XFER_ACTIVE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.WR_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_WR_XFER_ACTIVE_OFF (8u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.RD_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_RD_XFER_ACTIVE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.RD_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_RD_XFER_ACTIVE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.RD_XFER_ACTIVE */
#define IFX_SDMMC_PSTATE_REG_RD_XFER_ACTIVE_OFF (9u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.BUF_WR_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_WR_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.BUF_WR_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_WR_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.BUF_WR_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_WR_ENABLE_OFF (10u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.BUF_RD_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_RD_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.BUF_RD_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_RD_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.BUF_RD_ENABLE */
#define IFX_SDMMC_PSTATE_REG_BUF_RD_ENABLE_OFF (11u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CARD_INSERTED */
#define IFX_SDMMC_PSTATE_REG_CARD_INSERTED_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CARD_INSERTED */
#define IFX_SDMMC_PSTATE_REG_CARD_INSERTED_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CARD_INSERTED */
#define IFX_SDMMC_PSTATE_REG_CARD_INSERTED_OFF (16u)

