HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_bf.h
/** \brief Length for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD1_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD1_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD1_OFF (0u)

/** \brief Length for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD1_LEN (3u)

/** \brief Mask for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD1_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD1 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD1_OFF (1u)

/** \brief Length for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD2_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD2_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_PWR_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_PWR_VDD2_OFF (4u)

/** \brief Length for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD2_LEN (3u)

/** \brief Mask for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD2_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_PWR_CTRL_Bits.SD_BUS_VOL_VDD2 */
#define IFX_SDMMC_PWR_CTRL_SD_BUS_VOL_VDD2_OFF (5u)

/** \brief Length for Ifx_SDMMC_BGAP_CTRL_Bits.STOP_BG_REQ */
#define IFX_SDMMC_BGAP_CTRL_STOP_BG_REQ_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BGAP_CTRL_Bits.STOP_BG_REQ */
#define IFX_SDMMC_BGAP_CTRL_STOP_BG_REQ_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BGAP_CTRL_Bits.STOP_BG_REQ */
#define IFX_SDMMC_BGAP_CTRL_STOP_BG_REQ_OFF (0u)

/** \brief Length for Ifx_SDMMC_BGAP_CTRL_Bits.CONTINUE_REQ */
#define IFX_SDMMC_BGAP_CTRL_CONTINUE_REQ_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BGAP_CTRL_Bits.CONTINUE_REQ */
#define IFX_SDMMC_BGAP_CTRL_CONTINUE_REQ_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BGAP_CTRL_Bits.CONTINUE_REQ */
#define IFX_SDMMC_BGAP_CTRL_CONTINUE_REQ_OFF (1u)

/** \brief Length for Ifx_SDMMC_BGAP_CTRL_Bits.RD_WAIT_CTRL */
#define IFX_SDMMC_BGAP_CTRL_RD_WAIT_CTRL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BGAP_CTRL_Bits.RD_WAIT_CTRL */
#define IFX_SDMMC_BGAP_CTRL_RD_WAIT_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BGAP_CTRL_Bits.RD_WAIT_CTRL */
#define IFX_SDMMC_BGAP_CTRL_RD_WAIT_CTRL_OFF (2u)

/** \brief Length for Ifx_SDMMC_BGAP_CTRL_Bits.INT_AT_BGAP */
#define IFX_SDMMC_BGAP_CTRL_INT_AT_BGAP_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BGAP_CTRL_Bits.INT_AT_BGAP */
#define IFX_SDMMC_BGAP_CTRL_INT_AT_BGAP_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BGAP_CTRL_Bits.INT_AT_BGAP */
#define IFX_SDMMC_BGAP_CTRL_INT_AT_BGAP_OFF (3u)

/** \brief Length for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INT */
#define IFX_SDMMC_WUP_CTRL_CARD_INT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INT */
#define IFX_SDMMC_WUP_CTRL_CARD_INT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INT */
#define IFX_SDMMC_WUP_CTRL_CARD_INT_OFF (0u)

/** \brief Length for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INSERT */
#define IFX_SDMMC_WUP_CTRL_CARD_INSERT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INSERT */
#define IFX_SDMMC_WUP_CTRL_CARD_INSERT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_WUP_CTRL_Bits.CARD_INSERT */
#define IFX_SDMMC_WUP_CTRL_CARD_INSERT_OFF (1u)

/** \brief Length for Ifx_SDMMC_WUP_CTRL_Bits.CARD_REMOVAL */
#define IFX_SDMMC_WUP_CTRL_CARD_REMOVAL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_WUP_CTRL_Bits.CARD_REMOVAL */
#define IFX_SDMMC_WUP_CTRL_CARD_REMOVAL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_WUP_CTRL_Bits.CARD_REMOVAL */
#define IFX_SDMMC_WUP_CTRL_CARD_REMOVAL_OFF (2u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_EN_OFF (0u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_STABLE */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_STABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_STABLE */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_STABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.INTERNAL_CLK_STABLE */
#define IFX_SDMMC_CLK_CTRL_INTERNAL_CLK_STABLE_OFF (1u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.SD_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_SD_CLK_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.SD_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_SD_CLK_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.SD_CLK_EN */
#define IFX_SDMMC_CLK_CTRL_SD_CLK_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.PLL_ENABLE */
#define IFX_SDMMC_CLK_CTRL_PLL_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.PLL_ENABLE */
#define IFX_SDMMC_CLK_CTRL_PLL_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.PLL_ENABLE */
#define IFX_SDMMC_CLK_CTRL_PLL_ENABLE_OFF (3u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.CLK_GEN_SELECT */
#define IFX_SDMMC_CLK_CTRL_CLK_GEN_SELECT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.CLK_GEN_SELECT */
#define IFX_SDMMC_CLK_CTRL_CLK_GEN_SELECT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.CLK_GEN_SELECT */
#define IFX_SDMMC_CLK_CTRL_CLK_GEN_SELECT_OFF (5u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.UPPER_FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_UPPER_FREQ_SEL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.UPPER_FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_UPPER_FREQ_SEL_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.UPPER_FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_UPPER_FREQ_SEL_OFF (6u)

/** \brief Length for Ifx_SDMMC_CLK_CTRL_Bits.FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_FREQ_SEL_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CLK_CTRL_Bits.FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_FREQ_SEL_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CLK_CTRL_Bits.FREQ_SEL */
#define IFX_SDMMC_CLK_CTRL_FREQ_SEL_OFF (8u)

/** \brief Length for Ifx_SDMMC_TOUT_CTRL_Bits.TOUT_CNT */
#define IFX_SDMMC_TOUT_CTRL_TOUT_CNT_LEN (4u)

/** \brief Mask for Ifx_SDMMC_TOUT_CTRL_Bits.TOUT_CNT */
#define IFX_SDMMC_TOUT_CTRL_TOUT_CNT_MSK (0xfu)

