HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_bf.h
/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_EBIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_EBIT_ERR_OFF (3u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_IDX_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_IDX_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_IDX_ERR_OFF (4u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_RESP_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_RESP_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_RESP_ERR_OFF (5u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_AUTO_CMD_STAT_CMD_NOT_ISSUED_AUTO_CMD12_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_AUTO_CMD_STAT_CMD_NOT_ISSUED_AUTO_CMD12_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_AUTO_CMD_STAT_CMD_NOT_ISSUED_AUTO_CMD12_OFF (7u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.UHS_MODE_SEL */
#define IFX_SDMMC_HOST_CTRL2_UHS_MODE_SEL_LEN (3u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.UHS_MODE_SEL */
#define IFX_SDMMC_HOST_CTRL2_UHS_MODE_SEL_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.UHS_MODE_SEL */
#define IFX_SDMMC_HOST_CTRL2_UHS_MODE_SEL_OFF (0u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.SIGNALING_EN */
#define IFX_SDMMC_HOST_CTRL2_SIGNALING_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.SIGNALING_EN */
#define IFX_SDMMC_HOST_CTRL2_SIGNALING_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.SIGNALING_EN */
#define IFX_SDMMC_HOST_CTRL2_SIGNALING_EN_OFF (3u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.DRV_STRENGTH_SEL */
#define IFX_SDMMC_HOST_CTRL2_DRV_STRENGTH_SEL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.DRV_STRENGTH_SEL */
#define IFX_SDMMC_HOST_CTRL2_DRV_STRENGTH_SEL_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.DRV_STRENGTH_SEL */
#define IFX_SDMMC_HOST_CTRL2_DRV_STRENGTH_SEL_OFF (4u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.EXEC_TUNING */
#define IFX_SDMMC_HOST_CTRL2_EXEC_TUNING_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.EXEC_TUNING */
#define IFX_SDMMC_HOST_CTRL2_EXEC_TUNING_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.EXEC_TUNING */
#define IFX_SDMMC_HOST_CTRL2_EXEC_TUNING_OFF (6u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.SAMPLE_CLK_SEL */
#define IFX_SDMMC_HOST_CTRL2_SAMPLE_CLK_SEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.SAMPLE_CLK_SEL */
#define IFX_SDMMC_HOST_CTRL2_SAMPLE_CLK_SEL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.SAMPLE_CLK_SEL */
#define IFX_SDMMC_HOST_CTRL2_SAMPLE_CLK_SEL_OFF (7u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.UHS2_IF_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_UHS2_IF_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.UHS2_IF_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_UHS2_IF_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.UHS2_IF_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_UHS2_IF_ENABLE_OFF (8u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.ADMA2_LEN_MODE */
#define IFX_SDMMC_HOST_CTRL2_ADMA2_LEN_MODE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.ADMA2_LEN_MODE */
#define IFX_SDMMC_HOST_CTRL2_ADMA2_LEN_MODE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.ADMA2_LEN_MODE */
#define IFX_SDMMC_HOST_CTRL2_ADMA2_LEN_MODE_OFF (10u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.CMD23_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_CMD23_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.CMD23_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_CMD23_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.CMD23_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_CMD23_ENABLE_OFF (11u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.HOST_VER4_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_HOST_VER4_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.HOST_VER4_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_HOST_VER4_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.HOST_VER4_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_HOST_VER4_ENABLE_OFF (12u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.ADDRESSING */
#define IFX_SDMMC_HOST_CTRL2_ADDRESSING_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.ADDRESSING */
#define IFX_SDMMC_HOST_CTRL2_ADDRESSING_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.ADDRESSING */
#define IFX_SDMMC_HOST_CTRL2_ADDRESSING_OFF (13u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.ASYNC_INT_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_ASYNC_INT_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.ASYNC_INT_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_ASYNC_INT_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.ASYNC_INT_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_ASYNC_INT_ENABLE_OFF (14u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL2_Bits.PRESET_VAL_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_PRESET_VAL_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL2_Bits.PRESET_VAL_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_PRESET_VAL_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL2_Bits.PRESET_VAL_ENABLE */
#define IFX_SDMMC_HOST_CTRL2_PRESET_VAL_ENABLE_OFF (15u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_FREQ_LEN (6u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_FREQ_MSK (0x3fu)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_FREQ_OFF (0u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_UNIT */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_UNIT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_UNIT */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_UNIT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.TOUT_CLK_UNIT */
#define IFX_SDMMC_CAPABILITIES1_TOUT_CLK_UNIT_OFF (7u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.BASE_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_BASE_CLK_FREQ_LEN (8u)

