HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_EMMC_CTRL_Bits.CQE_ALGO_SEL */
#define IFX_SDMMC_EMMC_CTRL_CQE_ALGO_SEL_OFF (9u)

/** \brief Length for Ifx_SDMMC_BOOT_CTRL_Bits.MAN_BOOT_EN */
#define IFX_SDMMC_BOOT_CTRL_MAN_BOOT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BOOT_CTRL_Bits.MAN_BOOT_EN */
#define IFX_SDMMC_BOOT_CTRL_MAN_BOOT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BOOT_CTRL_Bits.MAN_BOOT_EN */
#define IFX_SDMMC_BOOT_CTRL_MAN_BOOT_EN_OFF (0u)

/** \brief Length for Ifx_SDMMC_BOOT_CTRL_Bits.VALIDATE_BOOT */
#define IFX_SDMMC_BOOT_CTRL_VALIDATE_BOOT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BOOT_CTRL_Bits.VALIDATE_BOOT */
#define IFX_SDMMC_BOOT_CTRL_VALIDATE_BOOT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BOOT_CTRL_Bits.VALIDATE_BOOT */
#define IFX_SDMMC_BOOT_CTRL_VALIDATE_BOOT_OFF (7u)

/** \brief Length for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_ACK_ENABLE */
#define IFX_SDMMC_BOOT_CTRL_BOOT_ACK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_ACK_ENABLE */
#define IFX_SDMMC_BOOT_CTRL_BOOT_ACK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_ACK_ENABLE */
#define IFX_SDMMC_BOOT_CTRL_BOOT_ACK_ENABLE_OFF (8u)

/** \brief Length for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_TOUT_CNT */
#define IFX_SDMMC_BOOT_CTRL_BOOT_TOUT_CNT_LEN (4u)

/** \brief Mask for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_TOUT_CNT */
#define IFX_SDMMC_BOOT_CTRL_BOOT_TOUT_CNT_MSK (0xfu)

/** \brief Offset for Ifx_SDMMC_BOOT_CTRL_Bits.BOOT_TOUT_CNT */
#define IFX_SDMMC_BOOT_CTRL_BOOT_TOUT_CNT_OFF (12u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_CLK_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_CLK_PIN_LEN (3u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_CLK_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_CLK_PIN_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_CLK_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_CLK_PIN_OFF (0u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_INT_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_INT_PIN_LEN (2u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_INT_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_INT_PIN_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.NUM_INT_PIN */
#define IFX_SDMMC_EMBEDDED_CTRL_NUM_INT_PIN_OFF (4u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BUS_WIDTH_PRESET */
#define IFX_SDMMC_EMBEDDED_CTRL_BUS_WIDTH_PRESET_LEN (7u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BUS_WIDTH_PRESET */
#define IFX_SDMMC_EMBEDDED_CTRL_BUS_WIDTH_PRESET_MSK (0x7fu)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BUS_WIDTH_PRESET */
#define IFX_SDMMC_EMBEDDED_CTRL_BUS_WIDTH_PRESET_OFF (8u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.CLK_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_CLK_PIN_SEL_LEN (3u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.CLK_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_CLK_PIN_SEL_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.CLK_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_CLK_PIN_SEL_OFF (16u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.INT_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_INT_PIN_SEL_LEN (3u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.INT_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_INT_PIN_SEL_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.INT_PIN_SEL */
#define IFX_SDMMC_EMBEDDED_CTRL_INT_PIN_SEL_OFF (20u)

/** \brief Length for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BACK_END_PWR_CTRL */
#define IFX_SDMMC_EMBEDDED_CTRL_BACK_END_PWR_CTRL_LEN (7u)

/** \brief Mask for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BACK_END_PWR_CTRL */
#define IFX_SDMMC_EMBEDDED_CTRL_BACK_END_PWR_CTRL_MSK (0x7fu)

/** \brief Offset for Ifx_SDMMC_EMBEDDED_CTRL_Bits.BACK_END_PWR_CTRL */
#define IFX_SDMMC_EMBEDDED_CTRL_BACK_END_PWR_CTRL_OFF (24u)

/** \brief Length for Ifx_SDMMC_CLC_Bits.DISR */
#define IFX_SDMMC_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLC_Bits.DISR */
#define IFX_SDMMC_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLC_Bits.DISR */
#define IFX_SDMMC_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_SDMMC_CLC_Bits.DISS */
#define IFX_SDMMC_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CLC_Bits.DISS */
#define IFX_SDMMC_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CLC_Bits.DISS */
#define IFX_SDMMC_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_SDMMC_ID_Bits.MODREV */
#define IFX_SDMMC_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_SDMMC_ID_Bits.MODREV */
#define IFX_SDMMC_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_ID_Bits.MODREV */
#define IFX_SDMMC_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_SDMMC_ID_Bits.MODTYPE */
#define IFX_SDMMC_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_SDMMC_ID_Bits.MODTYPE */
#define IFX_SDMMC_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_ID_Bits.MODTYPE */
#define IFX_SDMMC_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_SDMMC_ID_Bits.MODNUM */
#define IFX_SDMMC_ID_MODNUM_LEN (16u)

/** \brief Mask for Ifx_SDMMC_ID_Bits.MODNUM */
#define IFX_SDMMC_ID_MODNUM_MSK (0xffffu)

/** \brief Offset for Ifx_SDMMC_ID_Bits.MODNUM */
#define IFX_SDMMC_ID_MODNUM_OFF (16u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN0 */
#define IFX_SDMMC_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN0 */
#define IFX_SDMMC_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN0 */
#define IFX_SDMMC_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN1 */
#define IFX_SDMMC_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN1 */
#define IFX_SDMMC_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN1 */
#define IFX_SDMMC_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN2 */
#define IFX_SDMMC_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN2 */
#define IFX_SDMMC_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN2 */
#define IFX_SDMMC_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN3 */
#define IFX_SDMMC_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN3 */
#define IFX_SDMMC_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN3 */
#define IFX_SDMMC_ACCEN0_EN3_OFF (3u)

